{"sessions":[{"id":"927","title":"Barcamp Setup","location":"55","description":"En este momento se harán las presentaciones y las votaciones de las charlas","subtype":"SESSION","startTimestamp":1404396000,"webLink":"http://es.droidcon.com/2014/2014/06/barcamp-droidconspain2014/","presenterIds":["920"],"endTimestamp":1404399600},{"id":"929","title":"Barcamp","location":"55","description":"Charlas elegidas en el setup.","subtype":"SESSION","startTimestamp":1404399600,"webLink":"http://es.droidcon.com/2014/2014/06/barcamp-droidconspain2014/","presenterIds":["920"],"endTimestamp":1404406800},{"id":"932","title":"Barcamp","location":"55","description":"Continúan las charlas seleccionadas.","subtype":"SESSION","startTimestamp":1404408600,"webLink":"http://es.droidcon.com/2014/2014/06/barcamp-droidconspain2014/","presenterIds":["920"],"endTimestamp":1404414000},{"id":"935","title":"Android y Swift: dominar ambos lados de la Fuerza","location":"54","description":"","subtype":"SESSION","startTimestamp":1404459000,"webLink":"","presenterIds":["919"],"endTimestamp":1404462600},{"id":"934","title":"Un movil Android seguro","location":"50","description":"Estoy muy agradecido de poder dar esta charla, porque para mí es una oportunidad importante de poder intercambiar información y opiniones con la industria, validar el trabajo que estamos haciendo, recoger ideas, etc. A pesar de esto, mi objetivo final será inspirar a la gente, demostrar que en España tenemos uno de los mejores niveles profesionales del mundo en todo lo que tiene que ver con Android, y animar a la gente a emprender. Si nosotros desde una pequeña oficina en Madrid hemos conseguido enviar teléfonos a más de cincuenta países, todo es posible.","subtype":"SESSION","startTimestamp":1404459000,"webLink":"","presenterIds":["912"],"endTimestamp":1404462600},{"id":"936","title":"Creando apps de negocio","location":"50","description":"Desde nuestra propia experiencia y punto de vista, así como las opiniones recogidas en muchos de los foros internacionales a los que tenemos acceso de la mano de GeneXus, daremos nuestro punto de vista sobre las diferentes tipologías de apps y cuáles creemos que tienen más futuro y posibilidades de negocio. Como decía, las LOB. Asimismo, en la misma charla daremos un par de directrices básicas que creemos esenciales para el desarrollo de este tipo de apps y, ya puestos, con GENEXUS, crearemos ante todo el auditorio una app Android 100% funcional, desde cero! partiendo (como repositorio de datos) de una aplicación de gestión que también crearemos allí mismo. ... Y todo ello en unos 40 minutos (esperemos que la tecnología nos respete y no haya ningún problema técnico)","subtype":"SESSION","startTimestamp":1404462600,"webLink":"","presenterIds":["907"],"endTimestamp":1404466200},{"id":"937","title":"Developing in Android (The Movie)","location":"54","description":"Decía algún filosofo del que no recuerdo ahora el nombre (por eso soy developer y no filosofo): Solo se que no se nada. Y de esto va un poco mi ponencia. Cuanto más leo, cuanto más comparto y más debato solo llego a la conclusión de lo poco que se y lo que aún me queda que aprender. La ponencia va de compartir esos conocimientos asimilados en mi última etapa y que aún siendo algunos de ellos básicos y relativamente sencillos por alguna razón los dejamos pasar por alto, los ignoramos y los olvidamos. El objetivo es motivar la autocritica constructiva y que cada uno saque sus propias conclusiones, reforzar conceptos necesarios para el desarrollo en Android y con suerte conseguir que los desarrollos de todos mejoren un poquito.","subtype":"SESSION","startTimestamp":1404462600,"webLink":"","presenterIds":["903"],"endTimestamp":1404466200},{"id":"939","title":"Moverio, las Smart glasses de Epson","location":"54","description":"Las smart glasses de Epson a fondo.","subtype":"SESSION","startTimestamp":1404468000,"webLink":"","presenterIds":["903"],"endTimestamp":1404471600},{"id":"938","title":"Porque todo no tiene porque ser igual","location":"50","description":"En mi charla sobre CustomViews, porque todo no tiene porqué ser igual, trataré de contar mis experiencias a la hora de tomar la decisión de crear o no uno de estos componentes, como hacer y que técnicas podemos usar para conseguir unos resultados de 10.","subtype":"SESSION","startTimestamp":1404468000,"webLink":"","presenterIds":["915"],"endTimestamp":1404471600},{"id":"940","title":"Algunas cosas que siempre quiso saber sobre testing y nunca se atrevió a preguntar","location":"50","description":"Mi charla va sobre testing, pero va a ser una charla algo peculiar, porque voy a intentar hablar, desde mi experiencia, de aquellas cosas que hacemos bien y también aquellas que hacemos mal. Intentado dar más que una guia de buenas prácticas poner en la mesa unas lineas de trabajo para que la gente se interese sobre el testing, se quiten el miedo sobre testear, sean capaces de convencer a sus jefes y se hagan preguntas sobre las bases sobre las cuales trabajan.","subtype":"SESSION","startTimestamp":1404471600,"webLink":"","presenterIds":["914"],"endTimestamp":1404475200},{"id":"964","title":"Building a VoIP Service using WebRTC","location":"54","description":"La idea detrás de esta charla es explicar a los asistentes cómo funcionan los servicios de Voz sobre IP. Además de mostrar cómo funciona la librería de WebRTC y ver los problemas que nos hemos encontrado a los largo de desarrollo de nuestra aplicación. También hablaré de las diferentes soluciones que hemos dado a estos problemas.","subtype":"SESSION","startTimestamp":1404471600,"webLink":"","presenterIds":["963"],"endTimestamp":1404475200},{"id":"951","title":"Automatic API Rest: simplifica tus consultas","location":"54","description":"En la charla Automatic Api Rest: simplifica tus consultas vamos a mostrar una herramienta Open Source creada en GeekyTheory con el fin de facilitar la integración de una base de datos externa (MySQL) con cualquier tipo de tecnología (Android, iOS, Python, Javascript...) que pueda leer y enviar datos en formato JSON o XML. Automatic Api Rest crea una serie de enlaces automáticos para consultar e insertar datos de manera fácil y ordenada a una base de datos externa. Esta herramienta ahorra horas de trabajo a aquellas personas que quieran integrar su aplicación Android con el exterior. Vamos a mostrar como en menos de 10 minutos podemos tener una potente herramienta que gestione una base de datos externa de manera fácil y segura desde Android.","subtype":"SESSION","startTimestamp":1404480600,"webLink":"","presenterIds":["905"],"endTimestamp":1404484200},{"id":"949","title":"Sony","location":"50","description":"","subtype":"SESSION","startTimestamp":1404480600,"webLink":"","presenterIds":[],"endTimestamp":1404484200},{"id":"941","title":"Building Nexgen WebRTC Android apps","location":"54","description":"","subtype":"SESSION","startTimestamp":1404484200,"webLink":"","presenterIds":["875"],"endTimestamp":1404487800},{"id":"952","title":"Developing AndroidWear Apps","location":"50","description":"","subtype":"SESSION","startTimestamp":1404484200,"webLink":"http://www.iplatform.org/blog/profile","presenterIds":["916"],"endTimestamp":1404487800},{"id":"953","title":"Android NDK Survival Guide","location":"50","description":"Como bien dice el título \"Android NDK Survival Guide\" va a ser una charla centrada en el NDK de android, con el que llevo trabajando 3 años. El NDK permite embeber código máquina nativo compilado en lenguajes C/C++. Hay muchas razones por las que puede llegar a ser necesario recurrir al NDK: código multiplataforma, alto rendimiento, acceso total al hardware, bypass de las reglas de seguridad de Java, etc. Durante la charla veremos como hacer todo esto, comentando un montón de lecciones aprendidas acompañadas de ejemplos prácticos y reales. Empezaremos con bindings básicos entre código nativo y Java, pero acabaremos en el lado oscuro haciendo locuras como un bypass de las reglas de Java o accediendo a APIs privados del core de Android mediante análisis de símbolos.","subtype":"SESSION","startTimestamp":1404489600,"webLink":"","presenterIds":["908"],"endTimestamp":1404493200},{"id":"954","title":"Geolocalización en Android: más allá del terminal","location":"54","description":"Mi charla se centra en el uso de geolocalización en las aplicaciones y como implantarla. Cada vez es más habitual que las apps utilicen la ubicación del terminal para poder ofrecer una experiencia de usuario más personalizada, por tanto, es necesario que los des arrolladores se familiaricen con el uso de estas APIs y sepan integrarlas de la manera más sencilla posible cuando sea necesario. Mi intención es transmitirle las nociones para poder desarrollar este tipo de aplicaciones que usan la ubicación sin tener que pasar algunos dolores de cabeza por los que ya pasé yo.","subtype":"SESSION","startTimestamp":1404489600,"webLink":"","presenterIds":["905"],"endTimestamp":1404493200},{"id":"955","title":"Effective Android UI","location":"50","description":"Trabajar sobre activities, fragments, layouts o views puede ser un trabajo arduo y doloroso. Aplicar buenas prácticas, no cometer los errores más típicos, cuándo y cómo hacer una custom view o qué patrones aplicar (MVP o MVVM) para mejorar la calidad del código sobre el que trabajamos serán algunos de los temas a tratar a lo largo de esta charla.","subtype":"SESSION","startTimestamp":1404493200,"webLink":"","presenterIds":["859"],"endTimestamp":1404496800},{"id":"956","title":"RAP (Rely on Android Platform)","location":"54","description":"Tras varios años desarrollando en Android siempre he tenido la sensación que es muy complicado encontrar documentación y sobre todo, ejemplos de cómo diseñar una arquitectura cliente-servidor con por ejemplo: tokens de usuario, persistencia de datos, etc. Es verdad que Android developers ha dado un salto cualitativo enorme, pero la sensación de alguien que empieza siempre suele ser... WTF! La charla R.A.P. (Rely on Android Platform) trata de cubrir esta demanda proporcionando tanto un análisis de la arquitectura que usamos en Aditium, como una aplicación demo.","subtype":"SESSION","startTimestamp":1404493200,"webLink":"","presenterIds":["906"],"endTimestamp":1404496800},{"id":"958","title":"Evolución Android. Del Framework a la supervivencia del más fuerte","location":"54","description":"","subtype":"SESSION","startTimestamp":1404496800,"webLink":"","presenterIds":["918"],"endTimestamp":1404500400},{"id":"957","title":"Wearable Tech: What´s next?","location":"50","description":"Hablaré sobre la evolución que tendrá la wearable Technology, es importante saber hacia dónde se dirige para comprender los movimientos y productos que van a lanzarse este año. Reflexionaremos sobre conceptos cómo lentillas inteligentes, nanotecnología, receptores neuronales o cibernética.","subtype":"SESSION","startTimestamp":1404496800,"webLink":"","presenterIds":["910"],"endTimestamp":1404500400},{"id":"960","title":"Presentación del Hackathon","location":"55","description":"Este año Droidcon MAD concluirá con una jornada completa dedicada a desarrollar apps de forma colaborativa. Tendréis desde las 9 de la mañana hasta las 6 de la tarde para programar aplicaciones que sorprendan y merezcan el favor del jurado.","subtype":"SESSION","startTimestamp":1404500400,"webLink":"http://es.droidcon.com/2014/2014/06/hackathon/","presenterIds":["959"],"endTimestamp":1404502200},{"id":"962","title":"Party","location":"55","description":"Os proponemos que, después de todas las charlas y conferencias, nos acompañéis el viernes a partir de las 21:00h. en la Zona Expo para pasar un buen rato con música android, drones sobrevolando la fiesta y cócteles hechos con Google Glass ¿Os hace?","subtype":"SESSION","startTimestamp":1404502200,"webLink":"http://es.droidcon.com/2014/2014/07/party-droidcon-mad/","presenterIds":[],"endTimestamp":1404509400},{"id":"966","title":"Google App Engine","location":"55","description":"","subtype":"SESSION","startTimestamp":1404547200,"webLink":"","presenterIds":["920","911"],"endTimestamp":1404550800},{"id":"968","title":"Realidad Aumentada más allá de Google Glass","location":"55","description":"En mi charla voy a explicar lo que es la Realidad Aumentada y cómo trabajar con ella, realizar aplicaciones que usen esta tecnología fácilmente con las herramientas de Metaio y cómo integrarla en dispositivos Android tanto smartphones como dispositivos wearables como Google Glass, EPSON Moverio y Vuzix ya que cada uno tiene sus particularidades.","subtype":"SESSION","startTimestamp":1404550800,"webLink":"","presenterIds":["913"],"endTimestamp":1404554400},{"id":"971","title":"Gradle y Android Studio, entorno productivo","location":"55","description":"El objetivo de la charla es intentar convencer y motivar a los más excépticos a utilizar Android Studio junto con Gradle. Explicando, entre otras cosas, como incrementar la productividad con las últimas características y plugins de ambos, proponiendo soluciones a los errores más habituales y mostrando en una demo las muchas ventajas que ofrece.","subtype":"SESSION","startTimestamp":1404556200,"webLink":"","presenterIds":["909"],"endTimestamp":1404559800},{"id":"979","title":"Desarrollo de videojuegos","location":"55","description":"","subtype":"SESSION","startTimestamp":1404559800,"webLink":"","presenterIds":["921"],"endTimestamp":1404563400},{"id":"980","title":"Monetización y modelo de negocio a partir de la publicidad","location":"50","description":"","subtype":"SESSION","startTimestamp":1404568800,"webLink":"","presenterIds":["922"],"endTimestamp":1404572400},{"id":"981","title":"Firefox OS: HTML5 apps development and their integration in Android","location":"50","description":"","subtype":"SESSION","startTimestamp":1404572400,"webLink":"","presenterIds":["923"],"endTimestamp":1404576000},{"id":"982","title":"Entrega de premios","location":"50","description":"","subtype":"SESSION","startTimestamp":1404576000,"webLink":"http://es.droidcon.com/2014/2014/06/hackathon/","presenterIds":["959"],"endTimestamp":1404577800}]}